#include "Hooking.hpp"
namespace FF7Remake 
{
	Hooking::Hooking() { MH_Initialize(); }

	Hooking::~Hooking()
	{
		DisableAllHooks();
		RemoveAllHooks();
		MH_Uninitialize();
	}

	void Hooking::Initialize()
	{
		//	Resolve Function Pointers
		pXInput_State				= (g_GameData->g_GameBaseAddr + Offsets::oXinputState);
		pAScene_Update				= (g_GameData->g_GameBaseAddr + Offsets::oSceneUpdate);
		pAPlayerState_SetHealth		= (g_GameData->g_GameBaseAddr + Offsets::oSetHealth);
		pAPlayerState_SetMana		= (g_GameData->g_GameBaseAddr + Offsets::oSetMana);
		pAPlayerState_SubItem		= (g_GameData->g_GameBaseAddr + Offsets::oSubItem);
		pATargetEntity_GetHP		= (g_GameData->g_GameBaseAddr + Offsets::oTargetGetHP);
		pATargetEntity_GetStaggerAmount = (g_GameData->g_GameBaseAddr + Offsets::oTargetGetStaggerAmount);

		if (Console::m_bGUI && g_D3D11Window->GetWindowContext())
		{
			if (pSwapchain_Present)
				CreateHook((LPVOID)pSwapchain_Present, &Swapchain_present_hook, (void**)&Swapchain_present_stub);

			if (pSwapchain_DrawIndexed)
				CreateHook((LPVOID)pSwapchain_DrawIndexed, &Swapchain_DrawIndexed_hook, (void**)&Swapchain_DrawIndexed_stub);

			g_GameData->m_ShowHud = true;
		}

		//	Controller Input Handler
		if (pXInput_State)
			CreateHook((LPVOID)pXInput_State, &XInput_State_hook, (void**)&XInput_State_stub);

		//	Render Scene Update 
		if (pAScene_Update)
			CreateHook((LPVOID)pAScene_Update, &AScene_Update_hook, (void**)&AScene_Update_stub);

		//	Party Set Health Handler

			.text:0000000140B1CC07                 call    sub_141C22CC0
			.text:0000000140B1CC0C                 mov     rcx, cs:qword_1457F5148
			.text:0000000140B1CC13
			.text:0000000140B1CC13 loc_140B1CC13:                          ; CODE XREF: APlayerState_SubItem+115↑j
			.text:0000000140B1CC13                 mov     rax, [rcx]
			.text:0000000140B1CC16                 mov     rdx, rbx
			.text:0000000140B1CC19                 call    qword ptr [rax+20h]
			.text:0000000140B1CC1C                 mov     [rsi+48h], r14
			.text:0000000140B1CC20
			.text:0000000140B1CC20 loc_140B1CC20:                          ; CODE XREF: APlayerState_SubItem+109↑j
			.text:0000000140B1CC20                 mov     rbx, [rsp+28h+arg_0]
			.text:0000000140B1CC25                 mov     r14, [rsp+28h+arg_8]
			.text:0000000140B1CC2A
			.text:0000000140B1CC2A loc_140B1CC2A:                          ; CODE XREF: APlayerState_SubItem+27↑j
			.text:0000000140B1CC2A                                         ; DATA XREF: .pdata:0000000145A771BC↓o ...
			.text:0000000140B1CC2A                 mov     rbp, [rsp+28h+arg_10]
			.text:0000000140B1CC2F                 mov     rsi, [rsp+28h+arg_18]
			.text:0000000140B1CC34                 add     rsp, 20h
			.text:0000000140B1CC38                 pop     rdi
			.text:0000000140B1CC39                 retn
			.text:0000000140B1CC39 APlayerState_SubItem endp
		*/


		///	IDA PSUEDOCODE
		/*
			v4 = a1 + 8i64 * a2;
			v11 = *(__int64 **)(v4 + 0x48); // inventory
			v12 = *v11;	// Slot
			v13 = *(_DWORD *)(v12 + 0xC) - *((_DWORD *)v11 + 3); // sub item
			
			//	ADJUSTED FOR READABILITY
			auto v4 = p + 8 * index;									// OnSubItem*
			AInventory* v11 = *(__int64**)(v4 + 0x48);					// inventory
			AItemSlot* v12 = reinterpret_cast<AItemSlot*>(*v11);		// ItemSlot
			int sub_amount = *((__int32*)v11 + 3);						// sub amount
			int v13 = v12->count - sub_amount;							// sub item new amount
		*/
		
		///	
		/*		
			///	RECREATION
			//	auto pUseItem = reinterpret_cast<OnUseItem*> (p);
			//	AItemSlot oItem = pUseItem->GetInventory()->Item;
			
			///	Get Other Slots
			//	AItemSlot* slot = pUseItem->GetItemSlot(index + 1);
			//	auto slot_item_count = slot->count;
		*/
		
		auto v4 = p + 8 * index;									// OnSubItem*
		auto v11 = *(__int64**)(v4 + 0x48);							// inventory
		AItemSlot* v12 = reinterpret_cast<AItemSlot*>(*v11);		// ItemSlot
		int sub_amount = *((__int32*)v11 + 3);						// sub amount
		int v13 = v12->count - sub_amount;							// sub item new amount

		if (g_Console->m_bVerbose)
			Console::Log("[+] [Hooking::APlayerState_SubItem(0x%llX, %d)]\n- subAmount: %d\n- origCount: %d\n- newCount: %d\n- bNullItem: %d\n\n", 
				p, index, sub_amount, v12->count, v13, g_GameData->bNullItem);

		if (g_GameData->bNullItem)
		{
			auto result = g_Hooking->APlayerState_SubItem_stub(p, index);

			//	Set new amount ( revert change )
			v12->count = (v13 + sub_amount);

			return result;
		}

		//	exec original fn
		return g_Hooking->APlayerState_SubItem_stub(p, index);
	}

	struct ATarget
	{
		int		Level;			//0x0008
		float	SpAtkTime;		//0x000C
		float	SpAtkTimeMax;	//0x0010
		float	AttackRate;		//0x0014
		int		HP;				//0x0018
		int		HPMax;			//0x001C
		char	pad_0020[8];	//0x0020
		int		Attack;			//0x0028
		int		MagicAtk;		//0x002C
		int		Defense;		//0x0030
		int		MagicDefense;	//0x0034
		char	pad_0038[8];	//0x0038

		//	
		virtual void Function0();
		virtual int GetLevel() = 0;
		virtual void SetLevel(int lvl);
		virtual float GetSpAtkTime() = 0;
		virtual void SetSpAtkTime(float time);
		virtual float GetSpAtkTimeMax() = 0;
		virtual void SetSpAtkTimeMax(float maxTime);
		virtual float GetAttackRate() = 0;
		virtual void SetAttackRate(float rate);
		virtual int GetHP() = 0;
		virtual void SetHP(int hp);
		virtual int GetHPMax() = 0;
		virtual void SetHPMax(int mp);
		virtual void Function13();
		virtual void Function14();
		virtual void Function15();
		virtual void Function16();
		virtual void Function17();
		virtual void Function18();
		virtual int GetAttack() = 0;
		virtual void SetAttack(int atk);
		virtual int GetMagicAtk() = 0;
		virtual void SetMagicAtk(int atk);
		virtual int GetDefense() = 0;
		virtual void SetDefense(int def);
		virtual int GetMagicDef() = 0;
		virtual void SetMagicDef(int def);
		virtual void Function27();
		virtual void Function28();
		virtual void Function29();
		virtual void Function30();
		virtual void Function31();
		virtual void Function32();
		virtual void Function33();
		virtual void Function34();
		virtual void Function35();
		virtual void Function36();

		bool IsValid();
	};	//Size: 0x0040
	
	bool ATarget::IsValid()
	{
		static __int64 TargetEntity_vfTable = g_GameData->g_GameBaseAddr + 0x4B3E5E8;
		__int64 vfTable_addr = *(__int64*)((__int64)&this->Level - 0x8);
		if (!vfTable_addr || vfTable_addr != TargetEntity_vfTable)
			return false;

		return true;
	}

	__int64 Hooking::ATargetEntity_GetHP_hook(__int64 p)
	{
		static bool bEditing{ false };	//	used so can call this function without stack overflow
		auto pTarget = reinterpret_cast<ATarget*>(p);
		if (!bEditing && pTarget && pTarget->IsValid())
		{
			bEditing = true;

			//	target health is restored ( note: target can still die if damage taken is > maxhp )
			if (g_GameData->bNullTargetDmg)
			{
				auto hp_max = pTarget->GetHPMax();
				auto hp = pTarget->GetHP();	//	recursion
				if (hp < hp_max)
					pTarget->SetHP(hp_max);
			}

			//	target is killed
			if (g_GameData->bKillTarget)
			{
				//	if (g_GameData->bMaxTargetLevel)
				//	{
				if (pTarget->GetLevel() != 9999)
					pTarget->SetLevel(9999);
					//	g_GameData->bMaxTargetLevel = false;
				//	}

				if (pTarget->GetHP() > 0)
					pTarget->SetHP(0);

				g_GameData->bKillTarget = false;
			}

			//	target wont attack player
			if (g_GameData->bNoTargetAttack)
			{
				if (pTarget->GetAttackRate() > 0.0f)
					pTarget->SetAttackRate(0.0f);
				if (pTarget->GetSpAtkTimeMax() > 0.0f)
					pTarget->SetSpAtkTimeMax(0.0f);
				
				//	g_GameData->bNoTargetAttack = false;
			}

			//	prevents targets from attacking , sets max level and sets health to 0
			if (g_GameData->bXpFarn)
			{
				if (pTarget->GetLevel() != 9999)
					pTarget->SetLevel(9999);

				if (pTarget->GetAttackRate() > 0.0f)
					pTarget->SetAttackRate(0.0f);

				if (pTarget->GetSpAtkTimeMax() > 0.0f)
					pTarget->SetSpAtkTimeMax(0.0f);

				if (pTarget->GetDefense() > 0)
					pTarget->SetDefense(0);
				
				if (pTarget->GetMagicDef() > 0)
					pTarget->SetMagicDef(0);

				if (pTarget->GetHP() > 0)//	recursion
					pTarget->SetHP(0);
			}

			bEditing = false;
		}
		return g_Hooking->ATargetEntity_GetHP_stub(p);
	}

	struct ATargetStagger
	{
		unsigned char pad_0000[0xCF8];	//	0x0000
		float Stagger;					//	0x0CF8
		float StaggerMax;				//	0x0CFC
	};
	__int64 Hooking::ATargetEntity_GetStaggerAmount_hook(__int64 a1)
	{
		if (g_GameData->bXpFarn || g_GameData->bTargetAlwaysStagger)
		{
			auto pEnt = reinterpret_cast<ATargetStagger*>(a1);
			if (pEnt)
				pEnt->Stagger = pEnt->StaggerMax;
		}

		return g_Hooking->ATargetEntity_GetStaggerAmount_stub(a1);
	}
}
